DELETE FROM user_role;
DELETE FROM users;
DELETE FROM meals;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_role (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (date_time, description, calories, user_id)
VALUES ('2020-01-30 10:00', 'Завтрак', 500, 100000),
       ('2020-01-30 13:00', 'Обед', 1000, 100000),
       ('2020-01-30 23:00', 'Ужин', 500, 100000),
       ('2020-01-31 00:00', 'Еда на граничное значение', 100, 100001),
       ('2020-01-31 10:00', 'Завтрак', 1000, 100001),
       ('2020-01-31 13:00', 'Обед', 500, 100001),
       ('2020-01-31 20:00', 'Ужин', 410, 100001),
       ('2020-01-31 10:00', 'Завтрак', 500, 100000),
       ('2020-01-31 20:00', 'Обед', 1000, 100000),
       ('2020-01-31 23:00', 'Ужин', 500, 100000),
       ('2020-02-01 10:00', 'Завтрак', 1000, 100001),
       ('2020-02-01 13:00', 'Обед', 500, 100001),
       ('2020-02-01 16:00', 'Перекус', 300, 100001),
       ('2020-02-01 20:00', 'Ужин', 410, 100001),
       ('2020-02-01 10:00', 'Завтрак', 500, 100000),
       ('2020-02-01 13:00', 'Обед', 1000, 100000),
       ('2020-02-01 20:00', 'Ужин', 500, 100000),
       ('2020-02-01 23:00', 'Пиво и чипсы', 300, 100000);
